<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px"> 

## Lab: SQL Practice

_Author: Matt Brems_

### Required Preparation

In order to run SQL queries within Python/this Jupyter notebook, you will need to install the following:

```bash
conda install sqlalchemy
conda install psycopg2
```

If you get an error trying to install `psycopg2`, you can install a stand-alone package (sufficient for everything you'll need to complete this lab) by entering the following anywhere in the terminal: 

```bash 
pip install psycopg2-binary
```

(If `pip` doesn't work for you, try `pip3 install psycopg2-binary`.)

### Instructions

In this lab, you're going to have ten prompts. Each prompt will require you to do two things:
1. Write a SQL query.
2. Use the result of that query to answer the question.

The purpose of this lab is to get you to practice your SQL - an **important** skill in data science! While it is possible to get these answers using Pandas, it should be your goal to do everything only in SQL.

**Data**: The data used in this lab is the Iowa liquor database. It contains various tables of transactions. The schema for this database is here:

<img src="./images/schema.png" alt="schema" width="750"/>

In [2]:
# Import Pandas and Create_Engine

import pandas as pd
from sqlalchemy import create_engine

# Set up the engine to access the data.
engine = create_engine('postgresql://analytics_student:analyticsga@analyticsga-psql.generalassemb.ly:5432/iowa_liquor_sales_database')

### Prompt 1

How many rows are there in the `stores` table of the Iowa liquor database?

In [11]:
# Use a SQL query to find the answer to the above prompt.

sql = "SELECT stores FROM stores"

pd.read_sql_query(sql, engine)

                                                 stores
0     (2106,"Hillstreet News and Tobacco",A,"2217 Co...
1     (2112,"Mike's Liquors",I,"407 Sharp St.\nGlenw...
2     (2113,"Jamboree Foods",A,"1119 Market St. Box ...
3     (2119,"Manly Liquor Store",I,"133 East Main\nM...
4     (2130,"Sycamore Convenience",A,"617 Sycamore\n...
...                                                 ...
1968  (9917,"Honey Creek Distillery",A,"29538, 210th...
1969  (9918,"Paradise Distilling Company",A,"245, Ra...
1970  (9919,"Dehner Distillery",A,"7500, University ...
1971  (9920,"Louisiana Spirits LLC",A,"20909, South ...
1972  (9921,"maDIKwe USA",A,"3101, Ingersoll Ave\nDe...

[1973 rows x 1 columns]

**Prompt 1 Answer**:

### Prompt 2

If you sort the stores in alphabetical order by name, which store is fourth?

In [15]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT * 
FROM stores 
ORDER BY name 
Limit 4;
"""


pd.read_sql_query(sql, engine)

,store,name,store_status,store_address,address_info
0,4986,218 Fuel Express & Chubby's Liquor,A,"68 Monroe St\nFloyd, IA 50435\n(43.12249790500...",None
1,3047,3047 Cub Foods / Iowa City,I,"855 Highway 1 West\nIowa City, IA 522460000\n(...",None
2,3060,3060 Cub Foods / Ames,I,"3121 Grand Ave\nAmes, IA 500100000\n(42.053458...",None
3,3061,3061 Cub Foods / Sioux City,I,"1732 Hamilton Blvd\nSioux City, IA 511030000\n...",None

**Prompt 2 Answer**:

### Prompt 3

Among those sales whose category name is `IMPORTED VODKA`, if you sort by vendor in alphabetical order, what is the bottle price and number of bottles bought in the first 3 transactions?
> You should give us three sets of numbers - one for each transaction.

In [17]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT btl_price, bottle_qty
from sales
where category_name = 'IMPORTED VODKA'
ORDER BY vendor ASC
limit 3;
"""

pd.read_sql_query(sql, engine)

  btl_price  bottle_qty
0     $8.99          12
1    $28.50           1
2    $28.50           3

**Prompt 3 Answer**:

### Prompt 4

What is the total amount of liquor sold in February 2015?

In [19]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT SUM(total)
FROM sales
WHERE extract(month from date)=2 AND extract(year from date)=2015;
"""
pd.read_sql_query(sql, engine)

           sum
0  21295350.55

**Prompt 4 Answer**:

### Prompt 5

Among all transactions where `IMPORTED VODKA` was sold, which vendor has the most transactions? Report the total number of transactions, the number of bottles sold, and the total amount of revenue from these transactions. Rename the columns to make sure there isn't any confusion as to what they mean!

In [ ]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT vendor, count(*) AS "Number of Transactions", SUM(bottle_qty) AS "Number of Bottles", SUM(total) AS "Total Revenue"
FROM S

"""

pd.read_sql_query(sql, engine)

**Prompt 5 Answer**:

### Prompt 6

The reason we sell things is to make money. In sales, the term **markup** means the amount of extra money charged for a product over the cost to make that product. (You can think of the markup as the profit for that product.)

In Iowa, the law states the minimum price at which liquor may be sold.

Calculate the markup (name this `Markup`) that shows the difference between the `btl_price` and the `state_btl_cost`. 

> If you haven't subtracted columns together before, [this StackOverflow question](https://stackoverflow.com/questions/7536996/multiplying-two-columns-in-sql-server/7537059) may be helpful.

In [ ]:
# Use a SQL query to find the answer to the above prompt.

sql = """

"""

pd.read_sql_query(sql, engine)

### Prompt 7

Calculate the "Percentage Markup" by dividing markup by the state bottle cost. (Rather than the total profit per bottle, this will tell you how much stores are increasing their price over the state minimum.)

After calculating the "Percentage Markup," calculate the average percentage markup per **store**. Which store has the largest average markup, and what is that average markup?

In [ ]:
# Use a SQL query to find the answer to the above prompt.

sql = """

"""

pd.read_sql_query(sql, engine)

**Prompt 7 Answer**:

### Prompt 8

Building off of your last query, retrieve the five stores with the highest average markup percentage. Along with the store IDs and average markup percentage, please return the minimum and maximum markup percentage for those stores, as well as the names and addresses of those store.

What are the names of the five stores?

In [ ]:
# Use a SQL query to find the answer to the above prompt.

sql = """

"""

pd.read_sql_query(sql, engine)

**Prompt 8 Answer**:

### Prompt 9

Which nine counties sell the highest number of bottles of liquor per capita (per person)? Calculate the average bottle size of the bottles of liquor sold by these counties rounded to the nearest first decimal place. Of the nine counties selling the highest number of bottles of liquor per capita, which county sells (on average) the largest bottle size?

**_BONUS FUN_**: This question can (also) be solved with a SQL subquery - that is, a query that queries a query! If you'd like to give this a try, you can read more about it [here](https://www.dofactory.com/sql/subquery). Otherwise, keep an eye out for the solution key!

In [ ]:
# Use a SQL query to find the answer to the above prompt.

sql = """

"""

pd.read_sql_query(sql, engine)

**Prompt 9 Answer**:

### Prompt 10 (advanced but required!)

In the `sales` table, three columns are `btl_price`, `bottle_qty`, and `total`. The `total` for a transaction _should be_ the product of `btl_price` and `bottle_qty`. How many transactions have a value of `total` that is not equal to `btl_price` time `bottle_qty`?

> There will be a type error as well! We cannot compare type `money` to type `real`. We have to convert `total` to type `money` so that we can compare the two directly. [This link](https://docs.microsoft.com/en-us/sql/t-sql/functions/cast-and-convert-transact-sql?view=sql-server-ver15#syntax) may be helpful to you!

In [20]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT
    table_name,
    column_name,
    is_nullable,
    data_type
FROM
    information_schema.columns
    WHERE table_name = 'sales'
"""

pd.read_sql_query(sql, engine)

   table_name        column_name is_nullable                    data_type
0       sales               date         YES  timestamp without time zone
1       sales  convenience_store         YES                         text
2       sales              store         YES                      integer
3       sales      county_number         YES                         text
4       sales             county         YES                         text
5       sales           category         YES                         text
6       sales      category_name         YES                         text
7       sales          vendor_no         YES                         text
8       sales             vendor         YES                         text
9       sales               item         YES                      integer
10      sales        description         YES                         text
11      sales               pack         YES                      integer
12      sales         liter_size         YES                      integer
13      sales     state_btl_cost         YES                        money
14      sales          btl_price         YES                        money
15      sales         bottle_qty         YES                      integer
16      sales              total         YES                      numeric

**Prompt 10 Answer**: